{
  "id": "summary_meet_1763269170841_1763271153650",
  "transcriptId": "meet_1763269170841",
  "transcriptName": "test meet",
  "summary": "Here's a concise summary of the Google Meet transcript:\n\n**📊 Overview**\n*   **Meeting purpose:** Sync progress on ContextAI for an upcoming hackathon demo.\n*   **Key participants:** Alice, Bob, Charlie, Diana.\n\n**📋 Main Topics**\n*   **WhatsApp Integration:** Stabilized, fetching 340 chats consistently. Puppeteer memory issue resolved with auto-restart and reduced overhead; sessions persist.\n*   **RAG & Event Extraction:** Retrieval works, but event extraction misses some decisions, particularly with indirect phrasing. A rule-based post-processor will be added to address this.\n*   **Deep Research Mode:** Takes ~12 seconds, considered acceptable for the demo given the output (1000-word intelligence summary).\n*   **Demo Showcase:** Will feature WhatsApp deep analysis, Q&A (\"Who is doing API integration?\"), and a unified dashboard view.\n*   **Discord Integration:** UI is ready, backend is not. Will be marked as \"Planned\" for roadmap clarity.\n*   **Gemini API:** Rotation with three keys now supports 180 requests per minute.\n*   **pgvector:** Search is very fast, queries resolve under 100ms with 2000 embeddings.\n*   **Embeddings:** Decision to stay with 768-dim embeddings for cost, speed, and sufficient semantic capability.\n*   **UI Performance:** Shader background is visually appealing but heavy on low-end laptops. GPU detection will be implemented to fallback to a static gradient if needed. Retro theme is well-received.\n*   **Pitch Deck Emphasis:** Unified multi-platform knowledge, RAG + pgvector, 340 real WhatsApp chats, production-ready features, and users not needing to change behavior.\n*   **Demo Transcript Sample:** Need a clean sample for testing the Meets analyzer.\n\n**✅ Action Items**\n*   **Charlie:** Add a rule-based post-processor for event extraction to identify decisions based on speaker agreement.\n*   **Bob:** Prepare mock transcripts for testing the Meets analyzer.\n*   **Alice:** Schedule a follow-up meeting for tonight to rehearse the 3-minute pitch.\n\n**💡 Key Takeaways**\n*   Significant progress has been made on core features like WhatsApp integration and RAG, addressing key technical challenges.\n*   The team is focused on a polished and impactful demo for the hackathon, prioritizing key features and user experience.\n*   Strategic decisions were made regarding embedding dimensions and UI performance optimization.\n*   Clear messaging for the pitch deck will highlight the project's strengths and value proposition.\n*   The importance of showcasing user-friendly aspects (no behavior change) is recognized.",
  "analysisDepth": "moderate",
  "analyzedAt": "2025-11-16T05:32:33.650Z"
}