{
  "id": "summary_meet_1763269170841_1763269177311",
  "transcriptId": "meet_1763269170841",
  "transcriptName": "test meet",
  "summary": "Here's a concise summary of the Google Meet transcript:\n\n**📊 Overview**\n*   **Meeting purpose:** Sync on ContextAI progress ahead of a hackathon, focusing on demo readiness and key selling points.\n*   **Key participants:** Alice (facilitator), Bob, Charlie, Diana.\n\n**📋 Main Topics**\n*   **WhatsApp Integration:** Bob has stabilized fetching all 340 chats and fixed the Puppeteer memory issue with an auto-restart wrapper and reduced headless overhead.\n*   **RAG/Event Extraction:** Diana reported that RAG retrieval works, but event extraction misses some indirect decisions. A rule-based post-processor will be added to address this.\n*   **Deep Research Mode:** The 12-second load time is deemed acceptable for the hackathon demo.\n*   **Demo Content:** To be showcased are WhatsApp deep analysis, a specific Q&A (\"Who is doing API integration?\"), and a unified dashboard view.\n*   **Discord Integration:** The UI is ready, but the backend is not. It will be marked as \"Planned\" for roadmap clarity.\n*   **API Performance:** Gemini API rotation supports 180 requests/minute, and pgvector search is fast (under 100ms for 2000 embeddings).\n*   **Embeddings:** Decision to stick with 768-dim embeddings for cost and speed.\n*   **UI Performance:** Shader background may be heavy on low-end laptops; a GPU detection fallback to a static gradient will be implemented. The retro theme is well-received.\n*   **Pitch Deck Emphasis:** Unified multi-platform knowledge, RAG + pgvector, 340 real WhatsApp chats, and production-ready features.\n*   **User Behavior:** ContextAI captures meaning without users changing their behavior (WhatsApp + Meets).\n*   **Meets Analyzer:** A clean demo transcript sample is needed for testing.\n\n**✅ Action Items**\n*   **Add rule-based post-processor for event extraction:** Charlie and Diana (implied collaboration).\n*   **Prepare mock transcripts for Meets analyzer testing:** Bob.\n*   **Rehearse the 3-minute pitch:** All (tonight).\n\n**💡 Key Takeaways**\n*   Significant progress has been made on core features, particularly WhatsApp integration and RAG.\n*   Potential areas for improvement (event extraction, UI performance) have clear solutions identified.\n*   The team is strategizing effectively for the hackathon demo and pitch deck, highlighting strong selling points.\n*   A clear understanding of what needs to be demonstrated and emphasized for the hackathon.\n*   Follow-ups needed: A clean demo transcript sample and pitch rehearsal tonight.",
  "analysisDepth": "moderate",
  "analyzedAt": "2025-11-16T04:59:37.311Z"
}